examples/starter-kit/scenarios/sample_task_02.yaml
version: 1
config:
  target: "https://api.somewebsite.com"
  phases:
    - duration: 30
      arrivalRate: 3
      maxVusers: 10
  processor: "../processors/sample_task_02.js"
scenarios:
  - flow:
      - function: "generateRandomData"
      - get:
          url: "/members/list"
          afterResponse: "printStatus"
      - post:
          url: "members/create"
          afterResponse: "printStatus"
          json:
            id: "{{ id }}"
            name: "{{ name }}"
      - get:
          url: "/members/{{ id }}"
          afterResponse: "printStatus"